In [1]:
import pandas as pd
import numpy as np

In [3]:
s1 = pd.Series(np.random.randint(1,high=5, size=100,dtype='I'))
s2 = pd.Series(np.random.randint(1,high=4, size=100,dtype='I'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='I'))


print(s1, s2, s3)

0     3
1     3
2     4
3     1
4     2
     ..
95    1
96    2
97    4
98    4
99    3
Length: 100, dtype: uint32 0     3
1     1
2     3
3     2
4     3
     ..
95    2
96    3
97    1
98    1
99    2
Length: 100, dtype: uint32 0     13576
1     18043
2     13462
3     12959
4     28380
      ...
95    26647
96    19057
97    18504
98    17051
99    25519
Length: 100, dtype: uint32

In [5]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  3  3  13576
1  3  1  18043
2  4  3  13462
3  1  2  12959
4  2  3  28380

In [15]:
housemkt.rename(columns={0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      3       3            13576
1      3       1            18043
2      4       3            13462
3      1       2            12959
4      2       3            28380

In [17]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       3
1       3
2       4
3       1
4       2
..    ...
95  26647
96  19057
97  18504
98  17051
99  25519

[300 rows x 1 columns]

In [19]:
len(bigcolumn)

300

In [23]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        3
1        3
2        4
3        1
4        2
..     ...
295  26647
296  19057
297  18504
298  17051
299  25519

[300 rows x 1 columns]